# 'brew tap'

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "thoughtbot/formulae"

# 'brew install'

brew "awscli"
brew "carthage"
brew "diff-so-fancy"
brew "direnv"
brew "fasd"
brew "git"
brew "git-lfs"
brew "hub"
brew "mas"
brew "nvm"
brew "rbenv"
brew "rcm"
brew "s3cmd"
brew "swiftgen"
brew "swiftlint"
brew "zsh-autosuggestions"
brew "zsh-completions"

# 'brew cask install'
cask "alfred"
# cask "android-studio"
# cask "dash"
cask "docker"
# cask "charles"
# cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kap"
# cask "paw"
cask "proxyman"
# cask "simpholders"
# cask "spotify"
cask "slack"
# cask "sourcetree"
cask "sequel-pro"
cask "visual-studio-code"

# fonts
cask "font-inconsolata-for-powerline"
cask "font-meslo-for-powerline"
cask "font-source-code-pro"
cask "font-jetbrains-mono"

# 'mas install'
mas "1Password", id: 443987910
mas "Magnet", id: 441258766
mas "Swift Playgrounds", id: 1496833156
mas "Dynamo", id: 1445910651
mas "Vimeo - Video Management", id: 1356686763
mas "CARROT Weather", id: 993487541
mas "Slack", id: 803453959
mas "Apple Developer", id: 640199958

